Repository: Atakan0zkan/QR-Maker-Scanner
Catalog: lib/l10n/app_*.arb
Languages: el

# appName
source: QR Scanner
el: Σαρωτής QR

source: Scan
el: Σάρωση

source: Create
el: Δημιουργία

source: History
el: Ιστορικό

source: Settings
el: Ρυθμίσεις

source: Scan QR Code
el: Σάρωση κώδικα QR

source: Create QR Code
el: Δημιουργία κώδικα QR

# alignCameraToScan
source: Align camera to scan QR code
el: Ευθυγραμμίστε την κάμερα για να σαρώσετε τον κώδικα QR

source: Scanned
el: Σαρωμένο

source: Scanned QR Codes
el: Σαρωμένοι κώδικες QR

source: Generated
el: Δημιουργημένο

source: Code Type
el: Τύπος κώδικα

source: Text
el: Κείμενο

source: Contact
el: Επαφή

source: Phone
el: Τηλέφωνο

source: Location
el: Τοποθεσία

# social
source: Social Media
el: Κοινωνικά δίκτυα

source: Enter URL
el: Εισαγάγετε URL

source: Enter text
el: Εισαγάγετε κείμενο

# textLabel
source: Text
el: Κείμενο

# textHint
source: Enter your text
el: Εισαγάγετε το κείμενό σας

# textRequired
source: Text is required
el: Το κείμενο είναι υποχρεωτικό

# ssid
source: Network Name (SSID)
el: Όνομα δικτύου (SSID)

source: Password
el: Κωδικός πρόσβασης

source: Security Type
el: Τύπος ασφάλειας

source: None
el: Κανένα

source: Name
el: Όνομα

source: Phone Number
el: Αριθμός τηλεφώνου

source: Email Address
el: Διεύθυνση email

source: Company
el: Εταιρεία

source: Subject
el: Θέμα

source: Message
el: Μήνυμα

source: Latitude
el: Γεωγραφικό πλάτος

source: Longitude
el: Γεωγραφικό μήκος

source: Generate
el: Δημιουργία

source: Save
el: Αποθήκευση

source: Share
el: Κοινοποίηση

source: Delete
el: Διαγραφή

source: Copy
el: Αντιγραφή

source: Open
el: Άνοιγμα

source: Open in Browser
el: Άνοιγμα στο πρόγραμμα περιήγησης

source: Add to Contacts
el: Προσθήκη στις επαφές

source: Connect to WiFi
el: Σύνδεση σε WiFi

source: Open in Maps
el: Άνοιγμα στους χάρτες

source: Call
el: Κλήση

source: Send Email
el: Αποστολή email

source: General
el: Γενικά

source: Notifications
el: Ειδοποιήσεις

# manageNotifications
source: Manage in-app notifications
el: Διαχείριση ειδοποιήσεων εντός της εφαρμογής

source: Language
el: Γλώσσα

# changeLanguage
source: Change app language
el: Αλλαγή γλώσσας εφαρμογής

source: Theme
el: Θέμα

# customizeTheme
source: Customize app theme
el: Προσαρμογή θέματος εφαρμογής

source: Privacy
el: Απόρρητο

source: Privacy Policy
el: Πολιτική Απορρήτου

# privacyPolicyTitle
source: Privacy Policy
el: Πολιτική Απορρήτου

source: View privacy policy
el: Προβολή πολιτικής απορρήτου

source: Terms of Service
el: Όροι Παροχής Υπηρεσιών

# termsOfServiceTitle
source: Terms of Service
el: Όροι Παροχής Υπηρεσιών

source: View terms of service
el: Προβολή όρων παροχής υπηρεσιών

source: About
el: Σχετικά

source: Version
el: Έκδοση

source: Camera Permission Required
el: Απαιτείται άδεια κάμερας

# cameraPermissionMessage
source: This app cannot work without camera permission. Please grant permission in settings.
el: Αυτή η εφαρμογή δεν μπορεί να λειτουργήσει χωρίς άδεια κάμερας. Παρακαλώ παραχωρήστε άδεια στις ρυθμίσεις.

source: Go to Settings
el: Μετάβαση στις ρυθμίσεις

source: Cancel
el: Άκυρο

source: Error
el: Σφάλμα

source: Success
el: Επιτυχία

# qrCodeSaved
source: QR code saved successfully
el: Ο κώδικας QR αποθηκεύτηκε με επιτυχία

source: QR code shared
el: Ο κώδικας QR κοινοποιήθηκε

source: Copied to clipboard
el: Αντιγράφηκε στο πρόχειρο

source: Invalid URL
el: Μη έγκυρο URL

# invalidEmail
source: Invalid email address
el: Μη έγκυρη διεύθυνση email

# invalidPhone
source: Invalid phone number
el: Μη έγκυρος αριθμός τηλεφώνου

# fieldRequired
source: This field is required
el: Αυτό το πεδίο είναι υποχρεωτικό

source: No history yet
el: Δεν υπάρχει ακόμη ιστορικό

# scanOrCreateQR
source: Scan or create your first QR code
el: Σαρώστε ή δημιουργήστε τον πρώτο σας κώδικα QR

source: Delete Confirmation
el: Επιβεβαίωση διαγραφής

# deleteMessage
source: Are you sure you want to delete this item?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το στοιχείο;

source: Yes
el: Ναι

source: No
el: Όχι

source: Light
el: Φωτεινό

source: Dark
el: Σκοτεινό

source: System
el: Σύστημα

source: Save as Image
el: Αποθήκευση ως εικόνα

source: Save as PDF
el: Αποθήκευση ως PDF

source: Export Options
el: Επιλογές εξαγωγής

source: Website
el: Ιστοσελίδα

source: Short Message
el: Σύντομο μήνυμα

source: Select Theme
el: Επιλογή θέματος

source: Select Language
el: Επιλογή γλώσσas

source: selected
el: επιλεγμένο

# noScannedQR
source: No scanned QR codes yet
el: Δεν έχουν σαρωθεί ακόμη κώδικες QR

# noScannedBarcode
source: No scanned barcodes yet
el: Δεν έχουν σαρωθεί ακόμη γραμμωτοί κώδικες

# noGeneratedQR
source: No generated QR codes yet
el: Δεν έχουν δημιουργηθεί ακόμη κώδικες QR

# noGeneratedBarcode
source: No generated barcodes yet
el: Δεν έχουν δημιουργηθεί ακόμη γραμμωτοί κώδικες

# selectItems
source: Select
el: Επιλογή

source: QR Codes
el: Κώδικες QR

source: Barcodes
el: Γραμμωτοί κώδικες

# deleteMultipleMessage
source: Are you sure you want to delete {count} items?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε {count} στοιχεία;

# deleteSingleMessage
source: Are you sure you want to delete this item?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το στοιχείο;

# scanQROrBarcode
source: Align camera to scan QR code or barcode
el: Ευθυγραμμίστε την κάμερα για να σαρώσετε τον κώδικα QR ή τον γραμμωτό κώδικα

# qrColorSettings
source: QR Code Colors
el: Χρώματα κώδικα QR

source: QR Color
el: Χρώμα QR

# backgroundColor
source: Background
el: Φόντο

source: Body Shape
el: Σχήμα σώματος

source: Square
el: Τετράγωνο

source: Circle
el: Κύκλος

source: Rounded Square
el: Στρογγυλεμένο τετράγωνο

source: Diamond
el: Ρόμβος

source: QR Logo
el: Λογότυπο QR

source: Gallery
el: Συλλογή

source: Eye Style
el: Στυλ ματιού

# dataModuleShape
source: Data Shape
el: Σχήμα δεδομένων

# backgroundStyle
source: Background
el: Φόντο

source: Gradient
el: Ντεγκραντέ

source: Rounded
el: Στρογγυλεμένο

# sunsetGradient
source: Sunset
el: Ηλιοβασίλεμα

# oceanGradient
source: Ocean
el: Ωκεανός

# fireGradient
source: Fire
el: Φωτιά

# itemsDeleted
source: {count} items deleted
el: {count} στοιχεία διαγράφηκαν

# deleteConfirmationTitle
source: Delete Confirmation
el: Επιβεβαίωση διαγραφής

source: Deleted
el: Διαγράφηκε

# ppSection1Title
source: 1. Collected Information
el: 1. Συλλεγόμενες πληροφορίες

# ppSection1Content
source: QR Scanner app collects the following information to improve user experience: • Content of QR codes you scan (stored locally on your device) • QR codes you create (stored locally on your device) • App usage preferences (theme, language, etc.) All data is stored locally on your device and is not sent to our servers.
el: Η εφαρμογή QR Scanner συλλέγει τις ακόλουθες πληροφορίες για τη βελτίωση της εμπειρίας του χρήστη: • Περιεχόμενο των κωδικών QR που σαρώνετε (αποθηκεύεται τοπικά στη συσκευή σας) • Κωδικοί QR που δημιουργείτε (αποθηκεύεται τοπικά στη συσκευή σας) • Προτιμήσεις χρήσης της εφαρμογής (θέμα, γλώσσα κ.λπ.) Όλα τα δεδομένα αποθηκεύονται τοπικά στη συσκευή σας και δεν αποστέλλονται στους διακομιστές μας.

# ppSection2Title
source: 2. Camera Permission
el: 2. Άδεια κάμερας

# ppSection2Content
source: Camera access permission is required to use the QR code scanning feature. The camera is only used during QR code scanning and no images are recorded or shared.
el: Απαιτείται άδεια πρόσβασης στην κάμερα για τη χρήση της δυνατότητας σάρωσης κωδικών QR. Η κάμερα χρησιμοποιείται μόνο κατά τη σάρωση κωδικών QR και δεν καταγράφονται ή κοινοποιούνται εικόνες.

# ppSection3Title
source: 3. Storage Permission
el: 3. Άδεια αποθήκευσης

# ppSection3Content
source: Storage permission may be required to save QR codes as images. This permission is only used to save QR code images upon your request.
el: Ενδέχεται να απαιτείται άδεια αποθήκευσης για την αποθήκευση κωδικών QR ως εικόνες. Αυτή η άδεια χρησιμοποιείται μόνο για την αποθήκευση εικόνων κωδικών QR κατόπιν αιτήματός σας.

# ppSection4Title
source: 4. Data Security
el: 4. Ασφάλεια δεδομένων

# ppSection4Content
source: All your data is stored encrypted on your device. No personal information is shared with third parties.
el: Όλα τα δεδομένα σας αποθηκεύονται κρυπτογραφημένα στη συσκευή σας. Δεν κοινοποιούνται προσωπικά στοιχεία σε τρίτους.

# ppSection5Title
source: 5. Advertisements
el: 5. Διαφημίσεις

# ppSection5Content
source: The app may display advertisements through Google AdMob. AdMob may use device information for ad delivery. For more information, please review Google's privacy policy.
el: Η εφαρμογή ενδέχεται να εμφανίζει διαφημίσεις μέσω του Google AdMob. Το AdMob ενδέχεται να χρησιμοποιεί πληροφορίες της συσκευής για την προβολή διαφημίσεων. Για περισσότερες πληροφορίες, ανατρέξτε στην πολιτική απορρήτου της Google.

# ppSection6Title
source: 6. Children's Privacy
el: 6. Απόρρητο παιδιών

# ppSection6Content
source: Our app does not knowingly collect personal information from children under 13. Parents should supervise their children's use of the app.
el: Η εφαρμογή μας δεν συλλέγει εν γνώσει της προσωπικά στοιχεία από παιδιά κάτω των 13 ετών. Οι γονείς θα πρέπει να επιβλέπουν τη χρήση της εφαρμογής από τα παιδιά τους.

# ppSection7Title
source: 7. Changes
el: 7. Αλλαγές

# ppSection7Content
source: This privacy policy may be updated from time to time. You will be notified within the app when significant changes occur.
el: Αυτή η πολιτική απορρήτου ενδέχεται να ενημερώνεται κατά καιρούς. Θα ειδοποιηθείτε εντός της εφαρμογής όταν προκύψουν σημαντικές αλλαγές.

# ppSection8Title
source: 8. Contact
el: 8. Επικοινωνία

# ppSection8Content
source: For questions about this privacy policy, please contact us. Last Updated: October 10, 2025
el: Για ερωτήσεις σχετικά με αυτήν την πολιτική απορρήτου, επικοινωνήστε μαζί μας. Τελευταία ενημέρωση: 10 Οκτωβρίου 2025

# tosSection1Title
source: 1. Acceptance
el: 1. Αποδοχή

# tosSection1Content
source: By using the QR Scanner app, you agree to these terms of service. If you do not agree to these terms, please do not use the app.
el: Χρησιμοποιώντας την εφαρμογή QR Scanner, συμφωνείτε με αυτούς τους όρους παροχής υπηρεσιών. Εάν δεν συμφωνείτε με αυτούς τους όρους, παρακαλούμε μην χρησιμοποιείτε την εφαρμογή.

# tosSection2Title
source: 2. License
el: 2. Άδεια

# tosSection2Content
source: You are granted a limited, non-transferable, non-exclusive license to use the QR Scanner app for personal, non-commercial use.
el: Σας χορηγείται περιορισμένη, μη μεταβιβάσιμη, μη αποκλειστική άδεια χρήσης της εφαρμογής QR Scanner για προσωπική, μη εμπορική χρήση.

# tosSection3Title
source: 3. Terms of Use
el: 3. Όροι χρήσης

# tosSection3Content
source: When using the app: • You will not create QR codes for illegal content • You will not violate the rights of others • You will not use the app maliciously • You will not share spam or harmful content
el: Κατά τη χρήση της εφαρμογής: • Δεν θα δημιουργείτε κωδικούς QR για παράνομο περιεχόμενο • Δεν θα παραβιάζετε τα δικαιώματα άλλων • Δεν θα χρησιμοποιείτε την εφαρμογή κακόβουλα • Δεν θα κοινοποιείτε ανεπιθύμητο ή επιβλαβές περιεχόμενο

# tosSection4Title
source: 4. Disclaimer
el: 4. Αποποίηση ευθύνης

# tosSection4Content
source: The app is provided "as is". We are not responsible for any damages that may arise from the content or use of QR codes. Make sure the QR codes you scan are safe. Be careful with QR codes from unknown sources.
el: Η εφαρμογή παρέχεται "ως έχει". Δεν είμαστε υπεύθυνοι για τυχόν ζημιές που ενδέχεται να προκύψουν από το περιεχόμενο ή τη χρήση των κωδικών QR. Βεβαιωθείτε ότι οι κωδικοί QR που σαρώνετε είναι ασφαλείς. Να είστε προσεκτικοί με κωδικούς QR από άγνωστες πηγές.

# tosSection5Title
source: 5. Content Responsibility
el: 5. Ευθύνη περιεχομένου

# tosSection5Content
source: You are solely responsible for the content of the QR codes you create and scan. Do not create illegal or harmful content.
el: Είστε αποκλειστικά υπεύθυνοι για το περιεχόμενο των κωδικών QR που δημιουργείτε και σαρώνετε. Μην δημιουργείτε παράνομο ή επιβλαβές περιεχόμενο.

# tosSection6Title
source: 6. Service Changes
el: 6. Αλλαγές υπηρεσίας

# tosSection6Content
source: We reserve the right to change the app's features, content, or availability without prior notice.
el: Διατηρούμε το δικαίωμα να αλλάξουμε τις δυνατότητες, το περιεχόμενο ή τη διαθεσιμότητα της εφαρμογής χωρίς προηγούμενη ειδοποίηση.

# tosSection7Title
source: 7. Account Suspension
el: 7. Αναστολή λογαριασμού

# tosSection7Content
source: We reserve the right to suspend or terminate your access to the app if you violate these terms.
el: Διατηρούμε το δικαίωμα να αναστείλουμε ή να τερματίσουμε την πρόσβασή σας στην εφαρμογή εάν παραβιάσετε αυτούς τους όρους.

# tosSection8Title
source: 8. Intellectual Property
el: 8. Πνευματική ιδιοκτησία

# tosSection8Content
source: All content, design, and code of the app are protected by copyright. Unauthorized copying, distribution, or modification is prohibited.
el: Όλο το περιεχόμενο, ο σχεδιασμός και ο κώδικας της εφαρμογής προστατεύονται από πνευματικά δικαιώματα. Απαγορεύεται η μη εξουσιοδοτημένη αντιγραφή, διανομή ή τροποποίηση.

# tosSection9Title
source: 9. Third-Party Links
el: 9. Σύνδεσμοι τρίτων

# tosSection9Content
source: The app may contain links to third-party websites or services. We are not responsible for the content or privacy practices of these sites.
el: Η εφαρμογή ενδέχεται να περιέχει συνδέσμους προς ιστότοπους ή υπηρεσίες τρίτων. Δεν είμαστε υπεύθυνοι για το περιεχόμενο ή τις πρακτικές απορρήτου αυτών των ιστότοπων.

# tosSection10Title
source: 10. Warranty Disclaimer
el: 10. Αποποίηση εγγύησης

# tosSection10Content
source: The app is provided without any warranty. We do not guarantee that it will operate uninterrupted or error-free.
el: Η εφαρμογή παρέχεται χωρίς καμία εγγύηση. Δεν εγγυόμαστε ότι θα λειτουργεί αδιάκοπα ή χωρίς σφάλματα.

# tosSection11Title
source: 11. Changes to Terms
el: 11. Αλλαγές στους όρους

# tosSection11Content
source: We reserve the right to change these terms of service at any time. Significant changes will be announced within the app.
el: Διατηρούμε το δικαίωμα να αλλάξουμε αυτούς τους όρους παροχής υπηρεσιών ανά πάσα στιγμή. Οι σημαντικές αλλαγές θα ανακοινώνονται εντός της εφαρμογής.

# tosSection12Title
source: 12. Contact
el: 12. Επικοινωνία

# tosSection12Content
source: For questions about these terms of service, please contact us. Last Updated: October 10, 2025
el: Για ερωτήσεις σχετικά με αυτούς τους όρους παροχής υπηρεσιών, επικοινωνήστε μαζί μας. Τελευταία ενημέρωση: 10 Οκτωβρίου 2025

# emailAppCannotOpen
source: Cannot open email app
el: Δεν είναι δυνατό το άνοιγμα της εφαρμογής email

source: Flash control failed
el: Ο έλεγχος του φλας απέτυχε

# cameraPermissionNeeded
source: Camera permission required
el: Απαιτείται άδεια κάμερας

source: Grant Permission
el: Χορήγηση άδειας

# noQRScannedYet
source: No QR codes scanned yet
el: Δεν έχουν σαρωθεί ακόμη κώδικες QR

# scannedLabel
source: Scanned
el: Σαρωμένο

# generatedLabel
source: Generated
el: Δημιουργημένο

source: Flash On
el: Φλας ενεργό

source: Flash Off
el: Φλας ανενεργό

source: Normal Mode
el: Κανονική λειτουργία

# batchScanMode
source: Batch Scan
el: Μαζική σάρωση

# scannedCodesLabel
source: Scanned Codes
el: Σαρωμένοι κώδικες

# enterCoordinates
source: Or Enter Coordinates
el: Ή εισαγάγετε συντεταγμένες

# enterLocationName
source: Please enter a location name
el: Παρακαλώ εισάγετε ένα όνομα τοποθεσίας

# cannotOpenMaps
source: Cannot open Google Maps
el: Δεν είναι δυνατό το άνοιγμα του Google Maps

# invalidCoordinateFormat
source: Invalid coordinate format. Example: 41.0082, 28.9784
el: Μη έγκυρη μορφή συντεταγμένων. Παράδειγμα: 41.0082, 28.9784

source: Share error
el: Σφάλμα κοινοποίησης

# urlCannotOpen
source: Cannot open URL
el: Δεν είναι δυνατό το άνοιγμα του URL

source: Bug Report
el: Αναφορά σφάλματος

source: Report bugs via email
el: Αναφορά σφαλμάτων μέσω email

source: Analytics
el: Αναλυτικά

source: Usage Statistics
el: Στατιστικά χρήσης

source: Total Events
el: Συνολικά συμβάντα

source: Event Types
el: Τύποι συμβάντων

source: Most Common
el: Πιο συχνό

source: First Event
el: Πρώτο συμβάν

source: Last Event
el: Τελευταίο συμβάν

source: Clear Analytics
el: Εκκαθάριση αναλυτικών στοιχείων

# analyticsCleared
source: Analytics data cleared
el: Τα δεδομένα αναλυτικών στοιχείων διαγράφηκαν

source: Profile URL
el: URL προφίλ

source: Send Message
el: Αποστολή μηνύματος
